RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/pwm_reg.h
/**
  ******************************************************************************
  * @file    pwm_reg.h
  * @version V1.0
  * @date    2020-11-24
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __PWM_REG_H__
#define __PWM_REG_H__

#include "bl808.h"

/* 0x00 : pwm0_config0 */
#define PWM0_CONFIG0_OFFSET   (0x00)
#define PWM_CLK_DIV           PWM_CLK_DIV
#define PWM_CLK_DIV_POS       (0U)
#define PWM_CLK_DIV_LEN       (16U)
#define PWM_CLK_DIV_MSK       (((1U << PWM_CLK_DIV_LEN) - 1) << PWM_CLK_DIV_POS)
#define PWM_CLK_DIV_UMSK      (~(((1U << PWM_CLK_DIV_LEN) - 1) << PWM_CLK_DIV_POS))
#define PWM_STOP_ON_REPT      PWM_STOP_ON_REPT
#define PWM_STOP_ON_REPT_POS  (19U)
#define PWM_STOP_ON_REPT_LEN  (1U)
#define PWM_STOP_ON_REPT_MSK  (((1U << PWM_STOP_ON_REPT_LEN) - 1) << PWM_STOP_ON_REPT_POS)
#define PWM_STOP_ON_REPT_UMSK (~(((1U << PWM_STOP_ON_REPT_LEN) - 1) << PWM_STOP_ON_REPT_POS))
#define PWM_ADC_TRG_SRC       PWM_ADC_TRG_SRC
#define PWM_ADC_TRG_SRC_POS   (20U)
#define PWM_ADC_TRG_SRC_LEN   (4U)
#define PWM_ADC_TRG_SRC_MSK   (((1U << PWM_ADC_TRG_SRC_LEN) - 1) << PWM_ADC_TRG_SRC_POS)
#define PWM_ADC_TRG_SRC_UMSK  (~(((1U << PWM_ADC_TRG_SRC_LEN) - 1) << PWM_ADC_TRG_SRC_POS))
#define PWM_SW_BREAK_EN       PWM_SW_BREAK_EN
#define PWM_SW_BREAK_EN_POS   (24U)
#define PWM_SW_BREAK_EN_LEN   (1U)
#define PWM_SW_BREAK_EN_MSK   (((1U << PWM_SW_BREAK_EN_LEN) - 1) << PWM_SW_BREAK_EN_POS)
#define PWM_SW_BREAK_EN_UMSK  (~(((1U << PWM_SW_BREAK_EN_LEN) - 1) << PWM_SW_BREAK_EN_POS))
#define PWM_EXT_BREAK_EN      PWM_EXT_BREAK_EN
#define PWM_EXT_BREAK_EN_POS  (25U)
#define PWM_EXT_BREAK_EN_LEN  (1U)
#define PWM_EXT_BREAK_EN_MSK  (((1U << PWM_EXT_BREAK_EN_LEN) - 1) << PWM_EXT_BREAK_EN_POS)
#define PWM_EXT_BREAK_EN_UMSK (~(((1U << PWM_EXT_BREAK_EN_LEN) - 1) << PWM_EXT_BREAK_EN_POS))
#define PWM_EXT_BREAK_PL      PWM_EXT_BREAK_PL
#define PWM_EXT_BREAK_PL_POS  (26U)
#define PWM_EXT_BREAK_PL_LEN  (1U)
#define PWM_EXT_BREAK_PL_MSK  (((1U << PWM_EXT_BREAK_PL_LEN) - 1) << PWM_EXT_BREAK_PL_POS)
#define PWM_EXT_BREAK_PL_UMSK (~(((1U << PWM_EXT_BREAK_PL_LEN) - 1) << PWM_EXT_BREAK_PL_POS))
#define PWM_STOP_EN           PWM_STOP_EN
#define PWM_STOP_EN_POS       (27U)
#define PWM_STOP_EN_LEN       (1U)
#define PWM_STOP_EN_MSK       (((1U << PWM_STOP_EN_LEN) - 1) << PWM_STOP_EN_POS)
#define PWM_STOP_EN_UMSK      (~(((1U << PWM_STOP_EN_LEN) - 1) << PWM_STOP_EN_POS))
#define PWM_STOP_MODE         PWM_STOP_MODE
#define PWM_STOP_MODE_POS     (28U)
#define PWM_STOP_MODE_LEN     (1U)
#define PWM_STOP_MODE_MSK     (((1U << PWM_STOP_MODE_LEN) - 1) << PWM_STOP_MODE_POS)
#define PWM_STOP_MODE_UMSK    (~(((1U << PWM_STOP_MODE_LEN) - 1) << PWM_STOP_MODE_POS))
#define PWM_STS_STOP          PWM_STS_STOP
#define PWM_STS_STOP_POS      (29U)
#define PWM_STS_STOP_LEN      (1U)
#define PWM_STS_STOP_MSK      (((1U << PWM_STS_STOP_LEN) - 1) << PWM_STS_STOP_POS)
#define PWM_STS_STOP_UMSK     (~(((1U << PWM_STS_STOP_LEN) - 1) << PWM_STS_STOP_POS))
#define PWM_REG_CLK_SEL       PWM_REG_CLK_SEL
#define PWM_REG_CLK_SEL_POS   (30U)
#define PWM_REG_CLK_SEL_LEN   (2U)
#define PWM_REG_CLK_SEL_MSK   (((1U << PWM_REG_CLK_SEL_LEN) - 1) << PWM_REG_CLK_SEL_POS)
#define PWM_REG_CLK_SEL_UMSK  (~(((1U << PWM_REG_CLK_SEL_LEN) - 1) << PWM_REG_CLK_SEL_POS))

/* 0x04 : pwm0_config1 */
#define PWM0_CONFIG1_OFFSET (0x04)
#define PWM_CH0_PEN         PWM_CH0_PEN
#define PWM_CH0_PEN_POS     (0U)
#define PWM_CH0_PEN_LEN     (1U)
#define PWM_CH0_PEN_MSK     (((1U << PWM_CH0_PEN_LEN) - 1) << PWM_CH0_PEN_POS)
#define PWM_CH0_PEN_UMSK    (~(((1U << PWM_CH0_PEN_LEN) - 1) << PWM_CH0_PEN_POS))
#define PWM_CH0_PSI         PWM_CH0_PSI
#define PWM_CH0_PSI_POS     (1U)
#define PWM_CH0_PSI_LEN     (1U)
#define PWM_CH0_PSI_MSK     (((1U << PWM_CH0_PSI_LEN) - 1) << PWM_CH0_PSI_POS)
#define PWM_CH0_PSI_UMSK    (~(((1U << PWM_CH0_PSI_LEN) - 1) << PWM_CH0_PSI_POS))
#define PWM_CH0_NEN         PWM_CH0_NEN
#define PWM_CH0_NEN_POS     (2U)
#define PWM_CH0_NEN_LEN     (1U)
#define PWM_CH0_NEN_MSK     (((1U << PWM_CH0_NEN_LEN) - 1) << PWM_CH0_NEN_POS)
#define PWM_CH0_NEN_UMSK    (~(((1U << PWM_CH0_NEN_LEN) - 1) << PWM_CH0_NEN_POS))
#define PWM_CH0_NSI         PWM_CH0_NSI
#define PWM_CH0_NSI_POS     (3U)
#define PWM_CH0_NSI_LEN     (1U)
#define PWM_CH0_NSI_MSK     (((1U << PWM_CH0_NSI_LEN) - 1) << PWM_CH0_NSI_POS)
#define PWM_CH0_NSI_UMSK    (~(((1U << PWM_CH0_NSI_LEN) - 1) << PWM_CH0_NSI_POS))
#define PWM_CH1_PEN         PWM_CH1_PEN
#define PWM_CH1_PEN_POS     (4U)
#define PWM_CH1_PEN_LEN     (1U)
#define PWM_CH1_PEN_MSK     (((1U << PWM_CH1_PEN_LEN) - 1) << PWM_CH1_PEN_POS)
#define PWM_CH1_PEN_UMSK    (~(((1U << PWM_CH1_PEN_LEN) - 1) << PWM_CH1_PEN_POS))
#define PWM_CH1_PSI         PWM_CH1_PSI
#define PWM_CH1_PSI_POS     (5U)
#define PWM_CH1_PSI_LEN     (1U)
#define PWM_CH1_PSI_MSK     (((1U << PWM_CH1_PSI_LEN) - 1) << PWM_CH1_PSI_POS)
#define PWM_CH1_PSI_UMSK    (~(((1U << PWM_CH1_PSI_LEN) - 1) << PWM_CH1_PSI_POS))
#define PWM_CH1_NEN         PWM_CH1_NEN
#define PWM_CH1_NEN_POS     (6U)
#define PWM_CH1_NEN_LEN     (1U)
#define PWM_CH1_NEN_MSK     (((1U << PWM_CH1_NEN_LEN) - 1) << PWM_CH1_NEN_POS)
#define PWM_CH1_NEN_UMSK    (~(((1U << PWM_CH1_NEN_LEN) - 1) << PWM_CH1_NEN_POS))
#define PWM_CH1_NSI         PWM_CH1_NSI
#define PWM_CH1_NSI_POS     (7U)
#define PWM_CH1_NSI_LEN     (1U)
#define PWM_CH1_NSI_MSK     (((1U << PWM_CH1_NSI_LEN) - 1) << PWM_CH1_NSI_POS)
#define PWM_CH1_NSI_UMSK    (~(((1U << PWM_CH1_NSI_LEN) - 1) << PWM_CH1_NSI_POS))
#define PWM_CH2_PEN         PWM_CH2_PEN
#define PWM_CH2_PEN_POS     (8U)
#define PWM_CH2_PEN_LEN     (1U)
#define PWM_CH2_PEN_MSK     (((1U << PWM_CH2_PEN_LEN) - 1) << PWM_CH2_PEN_POS)
#define PWM_CH2_PEN_UMSK    (~(((1U << PWM_CH2_PEN_LEN) - 1) << PWM_CH2_PEN_POS))
#define PWM_CH2_PSI         PWM_CH2_PSI
#define PWM_CH2_PSI_POS     (9U)
#define PWM_CH2_PSI_LEN     (1U)
#define PWM_CH2_PSI_MSK     (((1U << PWM_CH2_PSI_LEN) - 1) << PWM_CH2_PSI_POS)
#define PWM_CH2_PSI_UMSK    (~(((1U << PWM_CH2_PSI_LEN) - 1) << PWM_CH2_PSI_POS))
#define PWM_CH2_NEN         PWM_CH2_NEN
#define PWM_CH2_NEN_POS     (10U)
#define PWM_CH2_NEN_LEN     (1U)
#define PWM_CH2_NEN_MSK     (((1U << PWM_CH2_NEN_LEN) - 1) << PWM_CH2_NEN_POS)
#define PWM_CH2_NEN_UMSK    (~(((1U << PWM_CH2_NEN_LEN) - 1) << PWM_CH2_NEN_POS))
#define PWM_CH2_NSI         PWM_CH2_NSI
#define PWM_CH2_NSI_POS     (11U)
#define PWM_CH2_NSI_LEN     (1U)
#define PWM_CH2_NSI_MSK     (((1U << PWM_CH2_NSI_LEN) - 1) << PWM_CH2_NSI_POS)
#define PWM_CH2_NSI_UMSK    (~(((1U << PWM_CH2_NSI_LEN) - 1) << PWM_CH2_NSI_POS))
#define PWM_CH3_PEN         PWM_CH3_PEN
#define PWM_CH3_PEN_POS     (12U)
#define PWM_CH3_PEN_LEN     (1U)
#define PWM_CH3_PEN_MSK     (((1U << PWM_CH3_PEN_LEN) - 1) << PWM_CH3_PEN_POS)
#define PWM_CH3_PEN_UMSK    (~(((1U << PWM_CH3_PEN_LEN) - 1) << PWM_CH3_PEN_POS))
#define PWM_CH3_PSI         PWM_CH3_PSI
#define PWM_CH3_PSI_POS     (13U)
#define PWM_CH3_PSI_LEN     (1U)
#define PWM_CH3_PSI_MSK     (((1U << PWM_CH3_PSI_LEN) - 1) << PWM_CH3_PSI_POS)
#define PWM_CH3_PSI_UMSK    (~(((1U << PWM_CH3_PSI_LEN) - 1) << PWM_CH3_PSI_POS))
#define PWM_CH3_NEN         PWM_CH3_NEN
#define PWM_CH3_NEN_POS     (14U)
#define PWM_CH3_NEN_LEN     (1U)
#define PWM_CH3_NEN_MSK     (((1U << PWM_CH3_NEN_LEN) - 1) << PWM_CH3_NEN_POS)
#define PWM_CH3_NEN_UMSK    (~(((1U << PWM_CH3_NEN_LEN) - 1) << PWM_CH3_NEN_POS))
#define PWM_CH3_NSI         PWM_CH3_NSI
#define PWM_CH3_NSI_POS     (15U)
#define PWM_CH3_NSI_LEN     (1U)
#define PWM_CH3_NSI_MSK     (((1U << PWM_CH3_NSI_LEN) - 1) << PWM_CH3_NSI_POS)
#define PWM_CH3_NSI_UMSK    (~(((1U << PWM_CH3_NSI_LEN) - 1) << PWM_CH3_NSI_POS))
#define PWM_CH0_PPL         PWM_CH0_PPL
#define PWM_CH0_PPL_POS     (16U)
#define PWM_CH0_PPL_LEN     (1U)
#define PWM_CH0_PPL_MSK     (((1U << PWM_CH0_PPL_LEN) - 1) << PWM_CH0_PPL_POS)
#define PWM_CH0_PPL_UMSK    (~(((1U << PWM_CH0_PPL_LEN) - 1) << PWM_CH0_PPL_POS))
#define PWM_CH0_NPL         PWM_CH0_NPL
#define PWM_CH0_NPL_POS     (17U)
#define PWM_CH0_NPL_LEN     (1U)
#define PWM_CH0_NPL_MSK     (((1U << PWM_CH0_NPL_LEN) - 1) << PWM_CH0_NPL_POS)
#define PWM_CH0_NPL_UMSK    (~(((1U << PWM_CH0_NPL_LEN) - 1) << PWM_CH0_NPL_POS))
#define PWM_CH1_PPL         PWM_CH1_PPL
#define PWM_CH1_PPL_POS     (18U)
#define PWM_CH1_PPL_LEN     (1U)
#define PWM_CH1_PPL_MSK     (((1U << PWM_CH1_PPL_LEN) - 1) << PWM_CH1_PPL_POS)
#define PWM_CH1_PPL_UMSK    (~(((1U << PWM_CH1_PPL_LEN) - 1) << PWM_CH1_PPL_POS))
#define PWM_CH1_NPL         PWM_CH1_NPL
#define PWM_CH1_NPL_POS     (19U)
#define PWM_CH1_NPL_LEN     (1U)
#define PWM_CH1_NPL_MSK     (((1U << PWM_CH1_NPL_LEN) - 1) << PWM_CH1_NPL_POS)
#define PWM_CH1_NPL_UMSK    (~(((1U << PWM_CH1_NPL_LEN) - 1) << PWM_CH1_NPL_POS))
#define PWM_CH2_PPL         PWM_CH2_PPL
#define PWM_CH2_PPL_POS     (20U)
#define PWM_CH2_PPL_LEN     (1U)
#define PWM_CH2_PPL_MSK     (((1U << PWM_CH2_PPL_LEN) - 1) << PWM_CH2_PPL_POS)
#define PWM_CH2_PPL_UMSK    (~(((1U << PWM_CH2_PPL_LEN) - 1) << PWM_CH2_PPL_POS))
#define PWM_CH2_NPL         PWM_CH2_NPL
#define PWM_CH2_NPL_POS     (21U)
#define PWM_CH2_NPL_LEN     (1U)
#define PWM_CH2_NPL_MSK     (((1U << PWM_CH2_NPL_LEN) - 1) << PWM_CH2_NPL_POS)
#define PWM_CH2_NPL_UMSK    (~(((1U << PWM_CH2_NPL_LEN) - 1) << PWM_CH2_NPL_POS))
#define PWM_CH3_PPL         PWM_CH3_PPL
#define PWM_CH3_PPL_POS     (22U)
#define PWM_CH3_PPL_LEN     (1U)
#define PWM_CH3_PPL_MSK     (((1U << PWM_CH3_PPL_LEN) - 1) << PWM_CH3_PPL_POS)
#define PWM_CH3_PPL_UMSK    (~(((1U << PWM_CH3_PPL_LEN) - 1) << PWM_CH3_PPL_POS))
#define PWM_CH3_NPL         PWM_CH3_NPL
#define PWM_CH3_NPL_POS     (23U)
#define PWM_CH3_NPL_LEN     (1U)
#define PWM_CH3_NPL_MSK     (((1U << PWM_CH3_NPL_LEN) - 1) << PWM_CH3_NPL_POS)
#define PWM_CH3_NPL_UMSK    (~(((1U << PWM_CH3_NPL_LEN) - 1) << PWM_CH3_NPL_POS))
#define PWM_CH0_PBS         PWM_CH0_PBS
#define PWM_CH0_PBS_POS     (24U)
#define PWM_CH0_PBS_LEN     (1U)
#define PWM_CH0_PBS_MSK     (((1U << PWM_CH0_PBS_LEN) - 1) << PWM_CH0_PBS_POS)
#define PWM_CH0_PBS_UMSK    (~(((1U << PWM_CH0_PBS_LEN) - 1) << PWM_CH0_PBS_POS))
#define PWM_CH0_NBS         PWM_CH0_NBS
#define PWM_CH0_NBS_POS     (25U)
#define PWM_CH0_NBS_LEN     (1U)
#define PWM_CH0_NBS_MSK     (((1U << PWM_CH0_NBS_LEN) - 1) << PWM_CH0_NBS_POS)
#define PWM_CH0_NBS_UMSK    (~(((1U << PWM_CH0_NBS_LEN) - 1) << PWM_CH0_NBS_POS))
#define PWM_CH1_PBS         PWM_CH1_PBS
#define PWM_CH1_PBS_POS     (26U)
#define PWM_CH1_PBS_LEN     (1U)
#define PWM_CH1_PBS_MSK     (((1U << PWM_CH1_PBS_LEN) - 1) << PWM_CH1_PBS_POS)
#define PWM_CH1_PBS_UMSK    (~(((1U << PWM_CH1_PBS_LEN) - 1) << PWM_CH1_PBS_POS))
#define PWM_CH1_NBS         PWM_CH1_NBS
#define PWM_CH1_NBS_POS     (27U)
#define PWM_CH1_NBS_LEN     (1U)
#define PWM_CH1_NBS_MSK     (((1U << PWM_CH1_NBS_LEN) - 1) << PWM_CH1_NBS_POS)
#define PWM_CH1_NBS_UMSK    (~(((1U << PWM_CH1_NBS_LEN) - 1) << PWM_CH1_NBS_POS))
#define PWM_CH2_PBS         PWM_CH2_PBS
#define PWM_CH2_PBS_POS     (28U)
#define PWM_CH2_PBS_LEN     (1U)
#define PWM_CH2_PBS_MSK     (((1U << PWM_CH2_PBS_LEN) - 1) << PWM_CH2_PBS_POS)
#define PWM_CH2_PBS_UMSK    (~(((1U << PWM_CH2_PBS_LEN) - 1) << PWM_CH2_PBS_POS))
#define PWM_CH2_NBS         PWM_CH2_NBS
#define PWM_CH2_NBS_POS     (29U)
#define PWM_CH2_NBS_LEN     (1U)
#define PWM_CH2_NBS_MSK     (((1U << PWM_CH2_NBS_LEN) - 1) << PWM_CH2_NBS_POS)
#define PWM_CH2_NBS_UMSK    (~(((1U << PWM_CH2_NBS_LEN) - 1) << PWM_CH2_NBS_POS))
#define PWM_CH3_PBS         PWM_CH3_PBS
#define PWM_CH3_PBS_POS     (30U)
#define PWM_CH3_PBS_LEN     (1U)
#define PWM_CH3_PBS_MSK     (((1U << PWM_CH3_PBS_LEN) - 1) << PWM_CH3_PBS_POS)
#define PWM_CH3_PBS_UMSK    (~(((1U << PWM_CH3_PBS_LEN) - 1) << PWM_CH3_PBS_POS))
#define PWM_CH3_NBS         PWM_CH3_NBS
#define PWM_CH3_NBS_POS     (31U)
#define PWM_CH3_NBS_LEN     (1U)
#define PWM_CH3_NBS_MSK     (((1U << PWM_CH3_NBS_LEN) - 1) << PWM_CH3_NBS_POS)
#define PWM_CH3_NBS_UMSK    (~(((1U << PWM_CH3_NBS_LEN) - 1) << PWM_CH3_NBS_POS))
/* 0x08 : pwm0_period */
#define PWM0_PERIOD_OFFSET      (0x08)
#define PWM_PERIOD              PWM_PERIOD
#define PWM_PERIOD_POS          (0U)
#define PWM_PERIOD_LEN          (16U)
#define PWM_PERIOD_MSK          (((1U << PWM_PERIOD_LEN) - 1) << PWM_PERIOD_POS)
#define PWM_PERIOD_UMSK         (~(((1U << PWM_PERIOD_LEN) - 1) << PWM_PERIOD_POS))
#define PWM_INT_PERIOD_CNT      PWM_INT_PERIOD_CNT
#define PWM_INT_PERIOD_CNT_POS  (16U)
#define PWM_INT_PERIOD_CNT_LEN  (16U)
#define PWM_INT_PERIOD_CNT_MSK  (((1U << PWM_INT_PERIOD_CNT_LEN) - 1) << PWM_INT_PERIOD_CNT_POS)
#define PWM_INT_PERIOD_CNT_UMSK (~(((1U << PWM_INT_PERIOD_CNT_LEN) - 1) << PWM_INT_PERIOD_CNT_POS))

