RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/pwm_reg.h
/* 0x0C : pwm0_dead_time */
#define PWM0_DEAD_TIME_OFFSET (0x0C)
#define PWM_CH0_DTG           PWM_CH0_DTG
#define PWM_CH0_DTG_POS       (0U)
#define PWM_CH0_DTG_LEN       (8U)
#define PWM_CH0_DTG_MSK       (((1U << PWM_CH0_DTG_LEN) - 1) << PWM_CH0_DTG_POS)
#define PWM_CH0_DTG_UMSK      (~(((1U << PWM_CH0_DTG_LEN) - 1) << PWM_CH0_DTG_POS))
#define PWM_CH1_DTG           PWM_CH1_DTG
#define PWM_CH1_DTG_POS       (8U)
#define PWM_CH1_DTG_LEN       (8U)
#define PWM_CH1_DTG_MSK       (((1U << PWM_CH1_DTG_LEN) - 1) << PWM_CH1_DTG_POS)
#define PWM_CH1_DTG_UMSK      (~(((1U << PWM_CH1_DTG_LEN) - 1) << PWM_CH1_DTG_POS))
#define PWM_CH2_DTG           PWM_CH2_DTG
#define PWM_CH2_DTG_POS       (16U)
#define PWM_CH2_DTG_LEN       (8U)
#define PWM_CH2_DTG_MSK       (((1U << PWM_CH2_DTG_LEN) - 1) << PWM_CH2_DTG_POS)
#define PWM_CH2_DTG_UMSK      (~(((1U << PWM_CH2_DTG_LEN) - 1) << PWM_CH2_DTG_POS))
#define PWM_CH3_DTG           PWM_CH3_DTG
#define PWM_CH3_DTG_POS       (24U)
#define PWM_CH3_DTG_LEN       (8U)
#define PWM_CH3_DTG_MSK       (((1U << PWM_CH3_DTG_LEN) - 1) << PWM_CH3_DTG_POS)
#define PWM_CH3_DTG_UMSK      (~(((1U << PWM_CH3_DTG_LEN) - 1) << PWM_CH3_DTG_POS))

/* 0x10 : pwm0_ch0_thre */
#define PWM0_CH0_THRE_OFFSET (0x10)
#define PWM_CH0_THREL        PWM_CH0_THREL
#define PWM_CH0_THREL_POS    (0U)
#define PWM_CH0_THREL_LEN    (16U)
#define PWM_CH0_THREL_MSK    (((1U << PWM_CH0_THREL_LEN) - 1) << PWM_CH0_THREL_POS)
#define PWM_CH0_THREL_UMSK   (~(((1U << PWM_CH0_THREL_LEN) - 1) << PWM_CH0_THREL_POS))
#define PWM_CH0_THREH        PWM_CH0_THREH
#define PWM_CH0_THREH_POS    (16U)
#define PWM_CH0_THREH_LEN    (16U)
#define PWM_CH0_THREH_MSK    (((1U << PWM_CH0_THREH_LEN) - 1) << PWM_CH0_THREH_POS)
#define PWM_CH0_THREH_UMSK   (~(((1U << PWM_CH0_THREH_LEN) - 1) << PWM_CH0_THREH_POS))

/* 0x14 : pwm0_ch1_thre */
#define PWM0_CH1_THRE_OFFSET (0x14)
#define PWM_CH1_THREL        PWM_CH1_THREL
#define PWM_CH1_THREL_POS    (0U)
#define PWM_CH1_THREL_LEN    (16U)
#define PWM_CH1_THREL_MSK    (((1U << PWM_CH1_THREL_LEN) - 1) << PWM_CH1_THREL_POS)
#define PWM_CH1_THREL_UMSK   (~(((1U << PWM_CH1_THREL_LEN) - 1) << PWM_CH1_THREL_POS))
#define PWM_CH1_THREH        PWM_CH1_THREH
#define PWM_CH1_THREH_POS    (16U)
#define PWM_CH1_THREH_LEN    (16U)
#define PWM_CH1_THREH_MSK    (((1U << PWM_CH1_THREH_LEN) - 1) << PWM_CH1_THREH_POS)
#define PWM_CH1_THREH_UMSK   (~(((1U << PWM_CH1_THREH_LEN) - 1) << PWM_CH1_THREH_POS))

/* 0x18 : pwm0_ch2_thre */
#define PWM0_CH2_THRE_OFFSET (0x18)
#define PWM_CH2_THREL        PWM_CH2_THREL
#define PWM_CH2_THREL_POS    (0U)
#define PWM_CH2_THREL_LEN    (16U)
#define PWM_CH2_THREL_MSK    (((1U << PWM_CH2_THREL_LEN) - 1) << PWM_CH2_THREL_POS)
#define PWM_CH2_THREL_UMSK   (~(((1U << PWM_CH2_THREL_LEN) - 1) << PWM_CH2_THREL_POS))
#define PWM_CH2_THREH        PWM_CH2_THREH
#define PWM_CH2_THREH_POS    (16U)
#define PWM_CH2_THREH_LEN    (16U)
#define PWM_CH2_THREH_MSK    (((1U << PWM_CH2_THREH_LEN) - 1) << PWM_CH2_THREH_POS)
#define PWM_CH2_THREH_UMSK   (~(((1U << PWM_CH2_THREH_LEN) - 1) << PWM_CH2_THREH_POS))

/* 0x1C : pwm0_ch3_thre */
#define PWM0_CH3_THRE_OFFSET (0x1C)
#define PWM_CH3_THREL        PWM_CH3_THREL
#define PWM_CH3_THREL_POS    (0U)
#define PWM_CH3_THREL_LEN    (16U)
#define PWM_CH3_THREL_MSK    (((1U << PWM_CH3_THREL_LEN) - 1) << PWM_CH3_THREL_POS)
#define PWM_CH3_THREL_UMSK   (~(((1U << PWM_CH3_THREL_LEN) - 1) << PWM_CH3_THREL_POS))
#define PWM_CH3_THREH        PWM_CH3_THREH
#define PWM_CH3_THREH_POS    (16U)
#define PWM_CH3_THREH_LEN    (16U)
#define PWM_CH3_THREH_MSK    (((1U << PWM_CH3_THREH_LEN) - 1) << PWM_CH3_THREH_POS)
#define PWM_CH3_THREH_UMSK   (~(((1U << PWM_CH3_THREH_LEN) - 1) << PWM_CH3_THREH_POS))

/* 0x20 : pwm0_int_sts */
#define PWM0_INT_STS_OFFSET (0x20)
#define PWM_CH0L_INT        PWM_CH0L_INT
#define PWM_CH0L_INT_POS    (0U)
#define PWM_CH0L_INT_LEN    (1U)
#define PWM_CH0L_INT_MSK    (((1U << PWM_CH0L_INT_LEN) - 1) << PWM_CH0L_INT_POS)
#define PWM_CH0L_INT_UMSK   (~(((1U << PWM_CH0L_INT_LEN) - 1) << PWM_CH0L_INT_POS))
#define PWM_CH0H_INT        PWM_CH0H_INT
#define PWM_CH0H_INT_POS    (1U)
#define PWM_CH0H_INT_LEN    (1U)
#define PWM_CH0H_INT_MSK    (((1U << PWM_CH0H_INT_LEN) - 1) << PWM_CH0H_INT_POS)
#define PWM_CH0H_INT_UMSK   (~(((1U << PWM_CH0H_INT_LEN) - 1) << PWM_CH0H_INT_POS))
#define PWM_CH1L_INT        PWM_CH1L_INT
#define PWM_CH1L_INT_POS    (2U)
#define PWM_CH1L_INT_LEN    (1U)
#define PWM_CH1L_INT_MSK    (((1U << PWM_CH1L_INT_LEN) - 1) << PWM_CH1L_INT_POS)
#define PWM_CH1L_INT_UMSK   (~(((1U << PWM_CH1L_INT_LEN) - 1) << PWM_CH1L_INT_POS))
#define PWM_CH1H_INT        PWM_CH1H_INT
#define PWM_CH1H_INT_POS    (3U)
#define PWM_CH1H_INT_LEN    (1U)
#define PWM_CH1H_INT_MSK    (((1U << PWM_CH1H_INT_LEN) - 1) << PWM_CH1H_INT_POS)
#define PWM_CH1H_INT_UMSK   (~(((1U << PWM_CH1H_INT_LEN) - 1) << PWM_CH1H_INT_POS))
#define PWM_CH2L_INT        PWM_CH2L_INT
#define PWM_CH2L_INT_POS    (4U)
#define PWM_CH2L_INT_LEN    (1U)
#define PWM_CH2L_INT_MSK    (((1U << PWM_CH2L_INT_LEN) - 1) << PWM_CH2L_INT_POS)
#define PWM_CH2L_INT_UMSK   (~(((1U << PWM_CH2L_INT_LEN) - 1) << PWM_CH2L_INT_POS))
#define PWM_CH2H_INT        PWM_CH2H_INT
#define PWM_CH2H_INT_POS    (5U)
#define PWM_CH2H_INT_LEN    (1U)
#define PWM_CH2H_INT_MSK    (((1U << PWM_CH2H_INT_LEN) - 1) << PWM_CH2H_INT_POS)
#define PWM_CH2H_INT_UMSK   (~(((1U << PWM_CH2H_INT_LEN) - 1) << PWM_CH2H_INT_POS))
#define PWM_CH3L_INT        PWM_CH3L_INT
#define PWM_CH3L_INT_POS    (6U)
#define PWM_CH3L_INT_LEN    (1U)
#define PWM_CH3L_INT_MSK    (((1U << PWM_CH3L_INT_LEN) - 1) << PWM_CH3L_INT_POS)
#define PWM_CH3L_INT_UMSK   (~(((1U << PWM_CH3L_INT_LEN) - 1) << PWM_CH3L_INT_POS))
#define PWM_CH3H_INT        PWM_CH3H_INT
#define PWM_CH3H_INT_POS    (7U)
#define PWM_CH3H_INT_LEN    (1U)
#define PWM_CH3H_INT_MSK    (((1U << PWM_CH3H_INT_LEN) - 1) << PWM_CH3H_INT_POS)
#define PWM_CH3H_INT_UMSK   (~(((1U << PWM_CH3H_INT_LEN) - 1) << PWM_CH3H_INT_POS))
#define PWM_PRDE_INT        PWM_PRDE_INT
#define PWM_PRDE_INT_POS    (8U)
#define PWM_PRDE_INT_LEN    (1U)
#define PWM_PRDE_INT_MSK    (((1U << PWM_PRDE_INT_LEN) - 1) << PWM_PRDE_INT_POS)
#define PWM_PRDE_INT_UMSK   (~(((1U << PWM_PRDE_INT_LEN) - 1) << PWM_PRDE_INT_POS))
#define PWM_BRK_INT         PWM_BRK_INT
#define PWM_BRK_INT_POS     (9U)
#define PWM_BRK_INT_LEN     (1U)
#define PWM_BRK_INT_MSK     (((1U << PWM_BRK_INT_LEN) - 1) << PWM_BRK_INT_POS)
#define PWM_BRK_INT_UMSK    (~(((1U << PWM_BRK_INT_LEN) - 1) << PWM_BRK_INT_POS))
#define PWM_REPT_INT        PWM_REPT_INT
#define PWM_REPT_INT_POS    (10U)
#define PWM_REPT_INT_LEN    (1U)
#define PWM_REPT_INT_MSK    (((1U << PWM_REPT_INT_LEN) - 1) << PWM_REPT_INT_POS)
#define PWM_REPT_INT_UMSK   (~(((1U << PWM_REPT_INT_LEN) - 1) << PWM_REPT_INT_POS))

/* 0x24 : pwm0_int_mask */
#define PWM0_INT_MASK_OFFSET      (0x24)
#define PWM_CR_PWM_CH0L_MASK      PWM_CR_PWM_CH0L_MASK
#define PWM_CR_PWM_CH0L_MASK_POS  (0U)
#define PWM_CR_PWM_CH0L_MASK_LEN  (1U)
#define PWM_CR_PWM_CH0L_MASK_MSK  (((1U << PWM_CR_PWM_CH0L_MASK_LEN) - 1) << PWM_CR_PWM_CH0L_MASK_POS)
#define PWM_CR_PWM_CH0L_MASK_UMSK (~(((1U << PWM_CR_PWM_CH0L_MASK_LEN) - 1) << PWM_CR_PWM_CH0L_MASK_POS))
#define PWM_CR_PWM_CH0H_MASK      PWM_CR_PWM_CH0H_MASK
#define PWM_CR_PWM_CH0H_MASK_POS  (1U)
#define PWM_CR_PWM_CH0H_MASK_LEN  (1U)
#define PWM_CR_PWM_CH0H_MASK_MSK  (((1U << PWM_CR_PWM_CH0H_MASK_LEN) - 1) << PWM_CR_PWM_CH0H_MASK_POS)
#define PWM_CR_PWM_CH0H_MASK_UMSK (~(((1U << PWM_CR_PWM_CH0H_MASK_LEN) - 1) << PWM_CR_PWM_CH0H_MASK_POS))
#define PWM_CR_PWM_CH1L_MASK      PWM_CR_PWM_CH1L_MASK
#define PWM_CR_PWM_CH1L_MASK_POS  (2U)
#define PWM_CR_PWM_CH1L_MASK_LEN  (1U)
#define PWM_CR_PWM_CH1L_MASK_MSK  (((1U << PWM_CR_PWM_CH1L_MASK_LEN) - 1) << PWM_CR_PWM_CH1L_MASK_POS)
#define PWM_CR_PWM_CH1L_MASK_UMSK (~(((1U << PWM_CR_PWM_CH1L_MASK_LEN) - 1) << PWM_CR_PWM_CH1L_MASK_POS))
#define PWM_CR_PWM_CH1H_MASK      PWM_CR_PWM_CH1H_MASK
#define PWM_CR_PWM_CH1H_MASK_POS  (3U)
#define PWM_CR_PWM_CH1H_MASK_LEN  (1U)
#define PWM_CR_PWM_CH1H_MASK_MSK  (((1U << PWM_CR_PWM_CH1H_MASK_LEN) - 1) << PWM_CR_PWM_CH1H_MASK_POS)
#define PWM_CR_PWM_CH1H_MASK_UMSK (~(((1U << PWM_CR_PWM_CH1H_MASK_LEN) - 1) << PWM_CR_PWM_CH1H_MASK_POS))
#define PWM_CR_PWM_CH2L_MASK      PWM_CR_PWM_CH2L_MASK
#define PWM_CR_PWM_CH2L_MASK_POS  (4U)
#define PWM_CR_PWM_CH2L_MASK_LEN  (1U)
#define PWM_CR_PWM_CH2L_MASK_MSK  (((1U << PWM_CR_PWM_CH2L_MASK_LEN) - 1) << PWM_CR_PWM_CH2L_MASK_POS)
#define PWM_CR_PWM_CH2L_MASK_UMSK (~(((1U << PWM_CR_PWM_CH2L_MASK_LEN) - 1) << PWM_CR_PWM_CH2L_MASK_POS))
#define PWM_CR_PWM_CH2H_MASK      PWM_CR_PWM_CH2H_MASK
#define PWM_CR_PWM_CH2H_MASK_POS  (5U)
#define PWM_CR_PWM_CH2H_MASK_LEN  (1U)
#define PWM_CR_PWM_CH2H_MASK_MSK  (((1U << PWM_CR_PWM_CH2H_MASK_LEN) - 1) << PWM_CR_PWM_CH2H_MASK_POS)
#define PWM_CR_PWM_CH2H_MASK_UMSK (~(((1U << PWM_CR_PWM_CH2H_MASK_LEN) - 1) << PWM_CR_PWM_CH2H_MASK_POS))
#define PWM_CR_PWM_CH3L_MASK      PWM_CR_PWM_CH3L_MASK
#define PWM_CR_PWM_CH3L_MASK_POS  (6U)
#define PWM_CR_PWM_CH3L_MASK_LEN  (1U)
#define PWM_CR_PWM_CH3L_MASK_MSK  (((1U << PWM_CR_PWM_CH3L_MASK_LEN) - 1) << PWM_CR_PWM_CH3L_MASK_POS)
#define PWM_CR_PWM_CH3L_MASK_UMSK (~(((1U << PWM_CR_PWM_CH3L_MASK_LEN) - 1) << PWM_CR_PWM_CH3L_MASK_POS))
#define PWM_CR_PWM_CH3H_MASK      PWM_CR_PWM_CH3H_MASK
#define PWM_CR_PWM_CH3H_MASK_POS  (7U)
#define PWM_CR_PWM_CH3H_MASK_LEN  (1U)
#define PWM_CR_PWM_CH3H_MASK_MSK  (((1U << PWM_CR_PWM_CH3H_MASK_LEN) - 1) << PWM_CR_PWM_CH3H_MASK_POS)
#define PWM_CR_PWM_CH3H_MASK_UMSK (~(((1U << PWM_CR_PWM_CH3H_MASK_LEN) - 1) << PWM_CR_PWM_CH3H_MASK_POS))
#define PWM_CR_PWM_PRDE_MASK      PWM_CR_PWM_PRDE_MASK
#define PWM_CR_PWM_PRDE_MASK_POS  (8U)
#define PWM_CR_PWM_PRDE_MASK_LEN  (1U)
#define PWM_CR_PWM_PRDE_MASK_MSK  (((1U << PWM_CR_PWM_PRDE_MASK_LEN) - 1) << PWM_CR_PWM_PRDE_MASK_POS)
#define PWM_CR_PWM_PRDE_MASK_UMSK (~(((1U << PWM_CR_PWM_PRDE_MASK_LEN) - 1) << PWM_CR_PWM_PRDE_MASK_POS))
#define PWM_CR_PWM_BRK_MASK       PWM_CR_PWM_BRK_MASK
#define PWM_CR_PWM_BRK_MASK_POS   (9U)
#define PWM_CR_PWM_BRK_MASK_LEN   (1U)
#define PWM_CR_PWM_BRK_MASK_MSK   (((1U << PWM_CR_PWM_BRK_MASK_LEN) - 1) << PWM_CR_PWM_BRK_MASK_POS)
#define PWM_CR_PWM_BRK_MASK_UMSK  (~(((1U << PWM_CR_PWM_BRK_MASK_LEN) - 1) << PWM_CR_PWM_BRK_MASK_POS))
#define PWM_CR_PWM_REPT_MASK      PWM_CR_PWM_REPT_MASK
#define PWM_CR_PWM_REPT_MASK_POS  (10U)
#define PWM_CR_PWM_REPT_MASK_LEN  (1U)
#define PWM_CR_PWM_REPT_MASK_MSK  (((1U << PWM_CR_PWM_REPT_MASK_LEN) - 1) << PWM_CR_PWM_REPT_MASK_POS)
#define PWM_CR_PWM_REPT_MASK_UMSK (~(((1U << PWM_CR_PWM_REPT_MASK_LEN) - 1) << PWM_CR_PWM_REPT_MASK_POS))

/* 0x28 : pwm0_int_clear */
#define PWM0_INT_CLEAR_OFFSET    (0x28)
#define PWM_CR_PWM_CH0L_CLR      PWM_CR_PWM_CH0L_CLR
#define PWM_CR_PWM_CH0L_CLR_POS  (0U)
#define PWM_CR_PWM_CH0L_CLR_LEN  (1U)
#define PWM_CR_PWM_CH0L_CLR_MSK  (((1U << PWM_CR_PWM_CH0L_CLR_LEN) - 1) << PWM_CR_PWM_CH0L_CLR_POS)
#define PWM_CR_PWM_CH0L_CLR_UMSK (~(((1U << PWM_CR_PWM_CH0L_CLR_LEN) - 1) << PWM_CR_PWM_CH0L_CLR_POS))
#define PWM_CR_PWM_CH0H_CLR      PWM_CR_PWM_CH0H_CLR
#define PWM_CR_PWM_CH0H_CLR_POS  (1U)
#define PWM_CR_PWM_CH0H_CLR_LEN  (1U)
#define PWM_CR_PWM_CH0H_CLR_MSK  (((1U << PWM_CR_PWM_CH0H_CLR_LEN) - 1) << PWM_CR_PWM_CH0H_CLR_POS)
#define PWM_CR_PWM_CH0H_CLR_UMSK (~(((1U << PWM_CR_PWM_CH0H_CLR_LEN) - 1) << PWM_CR_PWM_CH0H_CLR_POS))
#define PWM_CR_PWM_CH1L_CLR      PWM_CR_PWM_CH1L_CLR
#define PWM_CR_PWM_CH1L_CLR_POS  (2U)
#define PWM_CR_PWM_CH1L_CLR_LEN  (1U)
#define PWM_CR_PWM_CH1L_CLR_MSK  (((1U << PWM_CR_PWM_CH1L_CLR_LEN) - 1) << PWM_CR_PWM_CH1L_CLR_POS)
#define PWM_CR_PWM_CH1L_CLR_UMSK (~(((1U << PWM_CR_PWM_CH1L_CLR_LEN) - 1) << PWM_CR_PWM_CH1L_CLR_POS))
#define PWM_CR_PWM_CH1H_CLR      PWM_CR_PWM_CH1H_CLR
#define PWM_CR_PWM_CH1H_CLR_POS  (3U)
#define PWM_CR_PWM_CH1H_CLR_LEN  (1U)
#define PWM_CR_PWM_CH1H_CLR_MSK  (((1U << PWM_CR_PWM_CH1H_CLR_LEN) - 1) << PWM_CR_PWM_CH1H_CLR_POS)
#define PWM_CR_PWM_CH1H_CLR_UMSK (~(((1U << PWM_CR_PWM_CH1H_CLR_LEN) - 1) << PWM_CR_PWM_CH1H_CLR_POS))
#define PWM_CR_PWM_CH2L_CLR      PWM_CR_PWM_CH2L_CLR
#define PWM_CR_PWM_CH2L_CLR_POS  (4U)
#define PWM_CR_PWM_CH2L_CLR_LEN  (1U)
#define PWM_CR_PWM_CH2L_CLR_MSK  (((1U << PWM_CR_PWM_CH2L_CLR_LEN) - 1) << PWM_CR_PWM_CH2L_CLR_POS)
#define PWM_CR_PWM_CH2L_CLR_UMSK (~(((1U << PWM_CR_PWM_CH2L_CLR_LEN) - 1) << PWM_CR_PWM_CH2L_CLR_POS))
#define PWM_CR_PWM_CH2H_CLR      PWM_CR_PWM_CH2H_CLR
#define PWM_CR_PWM_CH2H_CLR_POS  (5U)
#define PWM_CR_PWM_CH2H_CLR_LEN  (1U)
#define PWM_CR_PWM_CH2H_CLR_MSK  (((1U << PWM_CR_PWM_CH2H_CLR_LEN) - 1) << PWM_CR_PWM_CH2H_CLR_POS)
#define PWM_CR_PWM_CH2H_CLR_UMSK (~(((1U << PWM_CR_PWM_CH2H_CLR_LEN) - 1) << PWM_CR_PWM_CH2H_CLR_POS))
#define PWM_CR_PWM_CH3L_CLR      PWM_CR_PWM_CH3L_CLR
#define PWM_CR_PWM_CH3L_CLR_POS  (6U)
#define PWM_CR_PWM_CH3L_CLR_LEN  (1U)
#define PWM_CR_PWM_CH3L_CLR_MSK  (((1U << PWM_CR_PWM_CH3L_CLR_LEN) - 1) << PWM_CR_PWM_CH3L_CLR_POS)
#define PWM_CR_PWM_CH3L_CLR_UMSK (~(((1U << PWM_CR_PWM_CH3L_CLR_LEN) - 1) << PWM_CR_PWM_CH3L_CLR_POS))
#define PWM_CR_PWM_CH3H_CLR      PWM_CR_PWM_CH3H_CLR
#define PWM_CR_PWM_CH3H_CLR_POS  (7U)
#define PWM_CR_PWM_CH3H_CLR_LEN  (1U)
#define PWM_CR_PWM_CH3H_CLR_MSK  (((1U << PWM_CR_PWM_CH3H_CLR_LEN) - 1) << PWM_CR_PWM_CH3H_CLR_POS)
#define PWM_CR_PWM_CH3H_CLR_UMSK (~(((1U << PWM_CR_PWM_CH3H_CLR_LEN) - 1) << PWM_CR_PWM_CH3H_CLR_POS))
#define PWM_CR_PWM_PRDE_CLR      PWM_CR_PWM_PRDE_CLR
#define PWM_CR_PWM_PRDE_CLR_POS  (8U)
#define PWM_CR_PWM_PRDE_CLR_LEN  (1U)
#define PWM_CR_PWM_PRDE_CLR_MSK  (((1U << PWM_CR_PWM_PRDE_CLR_LEN) - 1) << PWM_CR_PWM_PRDE_CLR_POS)
#define PWM_CR_PWM_PRDE_CLR_UMSK (~(((1U << PWM_CR_PWM_PRDE_CLR_LEN) - 1) << PWM_CR_PWM_PRDE_CLR_POS))
#define PWM_CR_PWM_BRK_CLR       PWM_CR_PWM_BRK_CLR
#define PWM_CR_PWM_BRK_CLR_POS   (9U)
#define PWM_CR_PWM_BRK_CLR_LEN   (1U)
#define PWM_CR_PWM_BRK_CLR_MSK   (((1U << PWM_CR_PWM_BRK_CLR_LEN) - 1) << PWM_CR_PWM_BRK_CLR_POS)
#define PWM_CR_PWM_BRK_CLR_UMSK  (~(((1U << PWM_CR_PWM_BRK_CLR_LEN) - 1) << PWM_CR_PWM_BRK_CLR_POS))
#define PWM_CR_PWM_REPT_CLR      PWM_CR_PWM_REPT_CLR
#define PWM_CR_PWM_REPT_CLR_POS  (10U)
#define PWM_CR_PWM_REPT_CLR_LEN  (1U)
#define PWM_CR_PWM_REPT_CLR_MSK  (((1U << PWM_CR_PWM_REPT_CLR_LEN) - 1) << PWM_CR_PWM_REPT_CLR_POS)
#define PWM_CR_PWM_REPT_CLR_UMSK (~(((1U << PWM_CR_PWM_REPT_CLR_LEN) - 1) << PWM_CR_PWM_REPT_CLR_POS))

/* 0x2C : pwm0_int_en */
#define PWM0_INT_EN_OFFSET      (0x2C)
#define PWM_CR_PWM_CH0L_EN      PWM_CR_PWM_CH0L_EN
#define PWM_CR_PWM_CH0L_EN_POS  (0U)
#define PWM_CR_PWM_CH0L_EN_LEN  (1U)
#define PWM_CR_PWM_CH0L_EN_MSK  (((1U << PWM_CR_PWM_CH0L_EN_LEN) - 1) << PWM_CR_PWM_CH0L_EN_POS)
#define PWM_CR_PWM_CH0L_EN_UMSK (~(((1U << PWM_CR_PWM_CH0L_EN_LEN) - 1) << PWM_CR_PWM_CH0L_EN_POS))
#define PWM_CR_PWM_CH0H_EN      PWM_CR_PWM_CH0H_EN
#define PWM_CR_PWM_CH0H_EN_POS  (1U)
#define PWM_CR_PWM_CH0H_EN_LEN  (1U)
#define PWM_CR_PWM_CH0H_EN_MSK  (((1U << PWM_CR_PWM_CH0H_EN_LEN) - 1) << PWM_CR_PWM_CH0H_EN_POS)
#define PWM_CR_PWM_CH0H_EN_UMSK (~(((1U << PWM_CR_PWM_CH0H_EN_LEN) - 1) << PWM_CR_PWM_CH0H_EN_POS))
#define PWM_CR_PWM_CH1L_EN      PWM_CR_PWM_CH1L_EN
#define PWM_CR_PWM_CH1L_EN_POS  (2U)
#define PWM_CR_PWM_CH1L_EN_LEN  (1U)
#define PWM_CR_PWM_CH1L_EN_MSK  (((1U << PWM_CR_PWM_CH1L_EN_LEN) - 1) << PWM_CR_PWM_CH1L_EN_POS)
#define PWM_CR_PWM_CH1L_EN_UMSK (~(((1U << PWM_CR_PWM_CH1L_EN_LEN) - 1) << PWM_CR_PWM_CH1L_EN_POS))
#define PWM_CR_PWM_CH1H_EN      PWM_CR_PWM_CH1H_EN
#define PWM_CR_PWM_CH1H_EN_POS  (3U)
#define PWM_CR_PWM_CH1H_EN_LEN  (1U)
#define PWM_CR_PWM_CH1H_EN_MSK  (((1U << PWM_CR_PWM_CH1H_EN_LEN) - 1) << PWM_CR_PWM_CH1H_EN_POS)
#define PWM_CR_PWM_CH1H_EN_UMSK (~(((1U << PWM_CR_PWM_CH1H_EN_LEN) - 1) << PWM_CR_PWM_CH1H_EN_POS))
#define PWM_CR_PWM_CH2L_EN      PWM_CR_PWM_CH2L_EN
#define PWM_CR_PWM_CH2L_EN_POS  (4U)
#define PWM_CR_PWM_CH2L_EN_LEN  (1U)
#define PWM_CR_PWM_CH2L_EN_MSK  (((1U << PWM_CR_PWM_CH2L_EN_LEN) - 1) << PWM_CR_PWM_CH2L_EN_POS)
#define PWM_CR_PWM_CH2L_EN_UMSK (~(((1U << PWM_CR_PWM_CH2L_EN_LEN) - 1) << PWM_CR_PWM_CH2L_EN_POS))
#define PWM_CR_PWM_CH2H_EN      PWM_CR_PWM_CH2H_EN
#define PWM_CR_PWM_CH2H_EN_POS  (5U)
#define PWM_CR_PWM_CH2H_EN_LEN  (1U)
#define PWM_CR_PWM_CH2H_EN_MSK  (((1U << PWM_CR_PWM_CH2H_EN_LEN) - 1) << PWM_CR_PWM_CH2H_EN_POS)
#define PWM_CR_PWM_CH2H_EN_UMSK (~(((1U << PWM_CR_PWM_CH2H_EN_LEN) - 1) << PWM_CR_PWM_CH2H_EN_POS))
#define PWM_CR_PWM_CH3L_EN      PWM_CR_PWM_CH3L_EN
#define PWM_CR_PWM_CH3L_EN_POS  (6U)
#define PWM_CR_PWM_CH3L_EN_LEN  (1U)
#define PWM_CR_PWM_CH3L_EN_MSK  (((1U << PWM_CR_PWM_CH3L_EN_LEN) - 1) << PWM_CR_PWM_CH3L_EN_POS)
#define PWM_CR_PWM_CH3L_EN_UMSK (~(((1U << PWM_CR_PWM_CH3L_EN_LEN) - 1) << PWM_CR_PWM_CH3L_EN_POS))
#define PWM_CR_PWM_CH3H_EN      PWM_CR_PWM_CH3H_EN
#define PWM_CR_PWM_CH3H_EN_POS  (7U)
#define PWM_CR_PWM_CH3H_EN_LEN  (1U)
#define PWM_CR_PWM_CH3H_EN_MSK  (((1U << PWM_CR_PWM_CH3H_EN_LEN) - 1) << PWM_CR_PWM_CH3H_EN_POS)
#define PWM_CR_PWM_CH3H_EN_UMSK (~(((1U << PWM_CR_PWM_CH3H_EN_LEN) - 1) << PWM_CR_PWM_CH3H_EN_POS))
#define PWM_CR_PWM_PRDE_EN      PWM_CR_PWM_PRDE_EN
#define PWM_CR_PWM_PRDE_EN_POS  (8U)
#define PWM_CR_PWM_PRDE_EN_LEN  (1U)
#define PWM_CR_PWM_PRDE_EN_MSK  (((1U << PWM_CR_PWM_PRDE_EN_LEN) - 1) << PWM_CR_PWM_PRDE_EN_POS)
#define PWM_CR_PWM_PRDE_EN_UMSK (~(((1U << PWM_CR_PWM_PRDE_EN_LEN) - 1) << PWM_CR_PWM_PRDE_EN_POS))
#define PWM_CR_PWM_BRK_EN       PWM_CR_PWM_BRK_EN
#define PWM_CR_PWM_BRK_EN_POS   (9U)
#define PWM_CR_PWM_BRK_EN_LEN   (1U)
#define PWM_CR_PWM_BRK_EN_MSK   (((1U << PWM_CR_PWM_BRK_EN_LEN) - 1) << PWM_CR_PWM_BRK_EN_POS)
#define PWM_CR_PWM_BRK_EN_UMSK  (~(((1U << PWM_CR_PWM_BRK_EN_LEN) - 1) << PWM_CR_PWM_BRK_EN_POS))
#define PWM_CR_PWM_REPT_EN      PWM_CR_PWM_REPT_EN
#define PWM_CR_PWM_REPT_EN_POS  (10U)
#define PWM_CR_PWM_REPT_EN_LEN  (1U)
#define PWM_CR_PWM_REPT_EN_MSK  (((1U << PWM_CR_PWM_REPT_EN_LEN) - 1) << PWM_CR_PWM_REPT_EN_POS)
#define PWM_CR_PWM_REPT_EN_UMSK (~(((1U << PWM_CR_PWM_REPT_EN_LEN) - 1) << PWM_CR_PWM_REPT_EN_POS))

struct pwm_reg {
    /* 0x00 : pwm0_config0 */
    union {
        struct {
            uint32_t pwm_clk_div      : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_18   : 3;  /* [18:16],       rsvd,        0x0 */
            uint32_t pwm_stop_on_rept : 1;  /* [   19],        r/w,        0x0 */
            uint32_t pwm_adc_trg_src  : 4;  /* [23:20],        r/w,        0xf */
            uint32_t pwm_sw_break_en  : 1;  /* [   24],        r/w,        0x0 */
            uint32_t pwm_ext_break_en : 1;  /* [   25],        r/w,        0x0 */
            uint32_t pwm_ext_break_pl : 1;  /* [   26],        r/w,        0x0 */
            uint32_t pwm_stop_en      : 1;  /* [   27],        r/w,        0x0 */
            uint32_t pwm_stop_mode    : 1;  /* [   28],        r/w,        0x1 */
            uint32_t pwm_sts_stop     : 1;  /* [   29],          r,        0x0 */
            uint32_t reg_clk_sel      : 2;  /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm0_config0;

    /* 0x04 : pwm0_config1 */
    union {
        struct {
            uint32_t pwm_ch0_pen : 1; /* [    0],        r/w,        0x0 */
            uint32_t pwm_ch0_psi : 1; /* [    1],        r/w,        0x0 */
            uint32_t pwm_ch0_nen : 1; /* [    2],        r/w,        0x0 */
            uint32_t pwm_ch0_nsi : 1; /* [    3],        r/w,        0x1 */
            uint32_t pwm_ch1_pen : 1; /* [    4],        r/w,        0x0 */
            uint32_t pwm_ch1_psi : 1; /* [    5],        r/w,        0x0 */
            uint32_t pwm_ch1_nen : 1; /* [    6],        r/w,        0x0 */
            uint32_t pwm_ch1_nsi : 1; /* [    7],        r/w,        0x1 */
            uint32_t pwm_ch2_pen : 1; /* [    8],        r/w,        0x0 */
            uint32_t pwm_ch2_psi : 1; /* [    9],        r/w,        0x0 */
            uint32_t pwm_ch2_nen : 1; /* [   10],        r/w,        0x0 */
            uint32_t pwm_ch2_nsi : 1; /* [   11],        r/w,        0x1 */
            uint32_t pwm_ch3_pen : 1; /* [   12],        r/w,        0x0 */
            uint32_t pwm_ch3_psi : 1; /* [   13],        r/w,        0x0 */
            uint32_t pwm_ch3_nen : 1; /* [   14],        r/w,        0x0 */
            uint32_t pwm_ch3_nsi : 1; /* [   15],        r/w,        0x1 */
            uint32_t pwm_ch0_ppl : 1; /* [   16],        r/w,        0x1 */
            uint32_t pwm_ch0_npl : 1; /* [   17],        r/w,        0x1 */
            uint32_t pwm_ch1_ppl : 1; /* [   18],        r/w,        0x1 */
            uint32_t pwm_ch1_npl : 1; /* [   19],        r/w,        0x1 */
            uint32_t pwm_ch2_ppl : 1; /* [   20],        r/w,        0x1 */
            uint32_t pwm_ch2_npl : 1; /* [   21],        r/w,        0x1 */
            uint32_t pwm_ch3_ppl : 1; /* [   22],        r/w,        0x1 */
            uint32_t pwm_ch3_npl : 1; /* [   23],        r/w,        0x1 */
            uint32_t pwm_ch0_pbs : 1; /* [   24],        r/w,        0x0 */
            uint32_t pwm_ch0_nbs : 1; /* [   25],        r/w,        0x0 */
            uint32_t pwm_ch1_pbs : 1; /* [   26],        r/w,        0x0 */
            uint32_t pwm_ch1_nbs : 1; /* [   27],        r/w,        0x0 */
            uint32_t pwm_ch2_pbs : 1; /* [   28],        r/w,        0x0 */
            uint32_t pwm_ch2_nbs : 1; /* [   29],        r/w,        0x0 */
            uint32_t pwm_ch3_pbs : 1; /* [   30],        r/w,        0x0 */
            uint32_t pwm_ch3_nbs : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm0_config1;

    /* 0x08 : pwm0_period */
    union {
        struct {
            uint32_t pwm_period         : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t pwm_int_period_cnt : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm0_period;

