RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/pwm_reg.h
/* 0x1C : pwm_ch3_thre */
#define PWM_CH3_THRE_OFFSET (0x1C)
#define PWM_CH3_THREL       PWM_CH3_THREL
#define PWM_CH3_THREL_POS   (0U)
#define PWM_CH3_THREL_LEN   (16U)
#define PWM_CH3_THREL_MSK   (((1U << PWM_CH3_THREL_LEN) - 1) << PWM_CH3_THREL_POS)
#define PWM_CH3_THREL_UMSK  (~(((1U << PWM_CH3_THREL_LEN) - 1) << PWM_CH3_THREL_POS))
#define PWM_CH3_THREH       PWM_CH3_THREH
#define PWM_CH3_THREH_POS   (16U)
#define PWM_CH3_THREH_LEN   (16U)
#define PWM_CH3_THREH_MSK   (((1U << PWM_CH3_THREH_LEN) - 1) << PWM_CH3_THREH_POS)
#define PWM_CH3_THREH_UMSK  (~(((1U << PWM_CH3_THREH_LEN) - 1) << PWM_CH3_THREH_POS))

/* 0x20 : pwm_int_sts */
#define PWM_INT_STS_OFFSET (0x20)
#define PWM_CH0L_INT       PWM_CH0L_INT
#define PWM_CH0L_INT_POS   (0U)
#define PWM_CH0L_INT_LEN   (1U)
#define PWM_CH0L_INT_MSK   (((1U << PWM_CH0L_INT_LEN) - 1) << PWM_CH0L_INT_POS)
#define PWM_CH0L_INT_UMSK  (~(((1U << PWM_CH0L_INT_LEN) - 1) << PWM_CH0L_INT_POS))
#define PWM_CH0H_INT       PWM_CH0H_INT
#define PWM_CH0H_INT_POS   (1U)
#define PWM_CH0H_INT_LEN   (1U)
#define PWM_CH0H_INT_MSK   (((1U << PWM_CH0H_INT_LEN) - 1) << PWM_CH0H_INT_POS)
#define PWM_CH0H_INT_UMSK  (~(((1U << PWM_CH0H_INT_LEN) - 1) << PWM_CH0H_INT_POS))
#define PWM_CH1L_INT       PWM_CH1L_INT
#define PWM_CH1L_INT_POS   (2U)
#define PWM_CH1L_INT_LEN   (1U)
#define PWM_CH1L_INT_MSK   (((1U << PWM_CH1L_INT_LEN) - 1) << PWM_CH1L_INT_POS)
#define PWM_CH1L_INT_UMSK  (~(((1U << PWM_CH1L_INT_LEN) - 1) << PWM_CH1L_INT_POS))
#define PWM_CH1H_INT       PWM_CH1H_INT
#define PWM_CH1H_INT_POS   (3U)
#define PWM_CH1H_INT_LEN   (1U)
#define PWM_CH1H_INT_MSK   (((1U << PWM_CH1H_INT_LEN) - 1) << PWM_CH1H_INT_POS)
#define PWM_CH1H_INT_UMSK  (~(((1U << PWM_CH1H_INT_LEN) - 1) << PWM_CH1H_INT_POS))
#define PWM_CH2L_INT       PWM_CH2L_INT
#define PWM_CH2L_INT_POS   (4U)
#define PWM_CH2L_INT_LEN   (1U)
#define PWM_CH2L_INT_MSK   (((1U << PWM_CH2L_INT_LEN) - 1) << PWM_CH2L_INT_POS)
#define PWM_CH2L_INT_UMSK  (~(((1U << PWM_CH2L_INT_LEN) - 1) << PWM_CH2L_INT_POS))
#define PWM_CH2H_INT       PWM_CH2H_INT
#define PWM_CH2H_INT_POS   (5U)
#define PWM_CH2H_INT_LEN   (1U)
#define PWM_CH2H_INT_MSK   (((1U << PWM_CH2H_INT_LEN) - 1) << PWM_CH2H_INT_POS)
#define PWM_CH2H_INT_UMSK  (~(((1U << PWM_CH2H_INT_LEN) - 1) << PWM_CH2H_INT_POS))
#define PWM_CH3L_INT       PWM_CH3L_INT
#define PWM_CH3L_INT_POS   (6U)
#define PWM_CH3L_INT_LEN   (1U)
#define PWM_CH3L_INT_MSK   (((1U << PWM_CH3L_INT_LEN) - 1) << PWM_CH3L_INT_POS)
#define PWM_CH3L_INT_UMSK  (~(((1U << PWM_CH3L_INT_LEN) - 1) << PWM_CH3L_INT_POS))
#define PWM_CH3H_INT       PWM_CH3H_INT
#define PWM_CH3H_INT_POS   (7U)
#define PWM_CH3H_INT_LEN   (1U)
#define PWM_CH3H_INT_MSK   (((1U << PWM_CH3H_INT_LEN) - 1) << PWM_CH3H_INT_POS)
#define PWM_CH3H_INT_UMSK  (~(((1U << PWM_CH3H_INT_LEN) - 1) << PWM_CH3H_INT_POS))
#define PWM_PRDE_INT       PWM_PRDE_INT
#define PWM_PRDE_INT_POS   (8U)
#define PWM_PRDE_INT_LEN   (1U)
#define PWM_PRDE_INT_MSK   (((1U << PWM_PRDE_INT_LEN) - 1) << PWM_PRDE_INT_POS)
#define PWM_PRDE_INT_UMSK  (~(((1U << PWM_PRDE_INT_LEN) - 1) << PWM_PRDE_INT_POS))
#define PWM_BRK_INT        PWM_BRK_INT
#define PWM_BRK_INT_POS    (9U)
#define PWM_BRK_INT_LEN    (1U)
#define PWM_BRK_INT_MSK    (((1U << PWM_BRK_INT_LEN) - 1) << PWM_BRK_INT_POS)
#define PWM_BRK_INT_UMSK   (~(((1U << PWM_BRK_INT_LEN) - 1) << PWM_BRK_INT_POS))
#define PWM_REPT_INT       PWM_REPT_INT
#define PWM_REPT_INT_POS   (10U)
#define PWM_REPT_INT_LEN   (1U)
#define PWM_REPT_INT_MSK   (((1U << PWM_REPT_INT_LEN) - 1) << PWM_REPT_INT_POS)
#define PWM_REPT_INT_UMSK  (~(((1U << PWM_REPT_INT_LEN) - 1) << PWM_REPT_INT_POS))

/* 0x24 : pwm_int_mask */
#define PWM_INT_MASK_OFFSET       (0x24)
#define PWM_CR_PWM_CH0L_MASK      PWM_CR_PWM_CH0L_MASK
#define PWM_CR_PWM_CH0L_MASK_POS  (0U)
#define PWM_CR_PWM_CH0L_MASK_LEN  (1U)
#define PWM_CR_PWM_CH0L_MASK_MSK  (((1U << PWM_CR_PWM_CH0L_MASK_LEN) - 1) << PWM_CR_PWM_CH0L_MASK_POS)
#define PWM_CR_PWM_CH0L_MASK_UMSK (~(((1U << PWM_CR_PWM_CH0L_MASK_LEN) - 1) << PWM_CR_PWM_CH0L_MASK_POS))
#define PWM_CR_PWM_CH0H_MASK      PWM_CR_PWM_CH0H_MASK
#define PWM_CR_PWM_CH0H_MASK_POS  (1U)
#define PWM_CR_PWM_CH0H_MASK_LEN  (1U)
#define PWM_CR_PWM_CH0H_MASK_MSK  (((1U << PWM_CR_PWM_CH0H_MASK_LEN) - 1) << PWM_CR_PWM_CH0H_MASK_POS)
#define PWM_CR_PWM_CH0H_MASK_UMSK (~(((1U << PWM_CR_PWM_CH0H_MASK_LEN) - 1) << PWM_CR_PWM_CH0H_MASK_POS))
#define PWM_CR_PWM_CH1L_MASK      PWM_CR_PWM_CH1L_MASK
#define PWM_CR_PWM_CH1L_MASK_POS  (2U)
#define PWM_CR_PWM_CH1L_MASK_LEN  (1U)
#define PWM_CR_PWM_CH1L_MASK_MSK  (((1U << PWM_CR_PWM_CH1L_MASK_LEN) - 1) << PWM_CR_PWM_CH1L_MASK_POS)
#define PWM_CR_PWM_CH1L_MASK_UMSK (~(((1U << PWM_CR_PWM_CH1L_MASK_LEN) - 1) << PWM_CR_PWM_CH1L_MASK_POS))
#define PWM_CR_PWM_CH1H_MASK      PWM_CR_PWM_CH1H_MASK
#define PWM_CR_PWM_CH1H_MASK_POS  (3U)
#define PWM_CR_PWM_CH1H_MASK_LEN  (1U)
#define PWM_CR_PWM_CH1H_MASK_MSK  (((1U << PWM_CR_PWM_CH1H_MASK_LEN) - 1) << PWM_CR_PWM_CH1H_MASK_POS)
#define PWM_CR_PWM_CH1H_MASK_UMSK (~(((1U << PWM_CR_PWM_CH1H_MASK_LEN) - 1) << PWM_CR_PWM_CH1H_MASK_POS))
#define PWM_CR_PWM_CH2L_MASK      PWM_CR_PWM_CH2L_MASK
#define PWM_CR_PWM_CH2L_MASK_POS  (4U)
#define PWM_CR_PWM_CH2L_MASK_LEN  (1U)
#define PWM_CR_PWM_CH2L_MASK_MSK  (((1U << PWM_CR_PWM_CH2L_MASK_LEN) - 1) << PWM_CR_PWM_CH2L_MASK_POS)
#define PWM_CR_PWM_CH2L_MASK_UMSK (~(((1U << PWM_CR_PWM_CH2L_MASK_LEN) - 1) << PWM_CR_PWM_CH2L_MASK_POS))
#define PWM_CR_PWM_CH2H_MASK      PWM_CR_PWM_CH2H_MASK
#define PWM_CR_PWM_CH2H_MASK_POS  (5U)
#define PWM_CR_PWM_CH2H_MASK_LEN  (1U)
#define PWM_CR_PWM_CH2H_MASK_MSK  (((1U << PWM_CR_PWM_CH2H_MASK_LEN) - 1) << PWM_CR_PWM_CH2H_MASK_POS)
#define PWM_CR_PWM_CH2H_MASK_UMSK (~(((1U << PWM_CR_PWM_CH2H_MASK_LEN) - 1) << PWM_CR_PWM_CH2H_MASK_POS))
#define PWM_CR_PWM_CH3L_MASK      PWM_CR_PWM_CH3L_MASK
#define PWM_CR_PWM_CH3L_MASK_POS  (6U)
#define PWM_CR_PWM_CH3L_MASK_LEN  (1U)
#define PWM_CR_PWM_CH3L_MASK_MSK  (((1U << PWM_CR_PWM_CH3L_MASK_LEN) - 1) << PWM_CR_PWM_CH3L_MASK_POS)
#define PWM_CR_PWM_CH3L_MASK_UMSK (~(((1U << PWM_CR_PWM_CH3L_MASK_LEN) - 1) << PWM_CR_PWM_CH3L_MASK_POS))
#define PWM_CR_PWM_CH3H_MASK      PWM_CR_PWM_CH3H_MASK
#define PWM_CR_PWM_CH3H_MASK_POS  (7U)
#define PWM_CR_PWM_CH3H_MASK_LEN  (1U)
#define PWM_CR_PWM_CH3H_MASK_MSK  (((1U << PWM_CR_PWM_CH3H_MASK_LEN) - 1) << PWM_CR_PWM_CH3H_MASK_POS)
#define PWM_CR_PWM_CH3H_MASK_UMSK (~(((1U << PWM_CR_PWM_CH3H_MASK_LEN) - 1) << PWM_CR_PWM_CH3H_MASK_POS))
#define PWM_CR_PWM_PRDE_MASK      PWM_CR_PWM_PRDE_MASK
#define PWM_CR_PWM_PRDE_MASK_POS  (8U)
#define PWM_CR_PWM_PRDE_MASK_LEN  (1U)
#define PWM_CR_PWM_PRDE_MASK_MSK  (((1U << PWM_CR_PWM_PRDE_MASK_LEN) - 1) << PWM_CR_PWM_PRDE_MASK_POS)
#define PWM_CR_PWM_PRDE_MASK_UMSK (~(((1U << PWM_CR_PWM_PRDE_MASK_LEN) - 1) << PWM_CR_PWM_PRDE_MASK_POS))
#define PWM_CR_PWM_BRK_MASK       PWM_CR_PWM_BRK_MASK
#define PWM_CR_PWM_BRK_MASK_POS   (9U)
#define PWM_CR_PWM_BRK_MASK_LEN   (1U)
#define PWM_CR_PWM_BRK_MASK_MSK   (((1U << PWM_CR_PWM_BRK_MASK_LEN) - 1) << PWM_CR_PWM_BRK_MASK_POS)
#define PWM_CR_PWM_BRK_MASK_UMSK  (~(((1U << PWM_CR_PWM_BRK_MASK_LEN) - 1) << PWM_CR_PWM_BRK_MASK_POS))
#define PWM_CR_PWM_REPT_MASK      PWM_CR_PWM_REPT_MASK
#define PWM_CR_PWM_REPT_MASK_POS  (10U)
#define PWM_CR_PWM_REPT_MASK_LEN  (1U)
#define PWM_CR_PWM_REPT_MASK_MSK  (((1U << PWM_CR_PWM_REPT_MASK_LEN) - 1) << PWM_CR_PWM_REPT_MASK_POS)
#define PWM_CR_PWM_REPT_MASK_UMSK (~(((1U << PWM_CR_PWM_REPT_MASK_LEN) - 1) << PWM_CR_PWM_REPT_MASK_POS))

